In [1]:
import pandas as pd

Pandas
  - Series 
  - Data frames

#### Creating a series using a python list

In [2]:
s1 = pd.Series([11,22,33,44,55,66,77,88])

In [3]:
s1

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
dtype: int64

In [4]:
s2  = pd.Series([11,22,33,44,55,66,77,88],['one', 'two', 'three', 'four', 'five', 'six' ,'seven' ,'eight'])

In [5]:
s2

one      11
two      22
three    33
four     44
five     55
six      66
seven    77
eight    88
dtype: int64

In [6]:
s2['two']

22

In [9]:
s2['two':"six"]

two     22
four    44
six     66
dtype: int64

In [8]:
s2[2:6]

three    33
four     44
five     55
six      66
dtype: int64

In [10]:
s2.values

array([11, 22, 33, 44, 55, 66, 77, 88], dtype=int64)

In [11]:
s2.index

Index(['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight'], dtype='object')

In [12]:
s2.index = ['a','b','c','d','e','f','g','h']

In [13]:
s2

a    11
b    22
c    33
d    44
e    55
f    66
g    77
h    88
dtype: int64

In [16]:
import numpy as np
a = np.arange(10)

dtype('int32')

In [19]:
s2[s2>44]

e    55
f    66
g    77
h    88
dtype: int64

In [20]:
s2*10

a    110
b    220
c    330
d    440
e    550
f    660
g    770
h    880
dtype: int64

In [21]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
s3 = pd.Series(sdata)
s3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
s3.values

array([35000, 71000, 16000,  5000], dtype=int64)

In [23]:
s3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [25]:
s3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

###### Creating a series from an existing series or dictionary

In [29]:
states = ['California', 'Ohio', 'Oregon', 'Texas',"NY"]
s4 =pd.Series(s3, index=states)
s4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
NY                NaN
dtype: float64

In [31]:
s4.isnull().sum()

2

In [33]:
s4.notnull().sum()

3

Note:

    Nan + Nan = NaN
    
    NaN + Value = Nan
    
    Value + NaN  = Nan
    
    Value + Value = Value

In [39]:
s5 = pd.Series([2000,3000,4000,5000,6000])
s6 = pd.Series([np.nan, 2000,6000, np.nan, 5000])

In [40]:
s5

0    2000
1    3000
2    4000
3    5000
4    6000
dtype: int64

In [41]:
s6

0       NaN
1    2000.0
2    6000.0
3       NaN
4    5000.0
dtype: float64

In [42]:
s5 + s6

0        NaN
1     5000.0
2    10000.0
3        NaN
4    11000.0
dtype: float64

In [43]:
s5+ s4

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
California   NaN
NY           NaN
Ohio         NaN
Oregon       NaN
Texas        NaN
dtype: float64

# DataFrame

In [52]:
data = {
        'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
       }

In [53]:
dataframe = pd.DataFrame(data)
dataframe

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [55]:
result = pd.DataFrame({"student_name":['Asad', 'Ali', 'Faheem','Baber', 'Nasir'],
                       "student_roll":[123,456,321,678,111,],
                      "Paper1":[90,89,78,76,65],
                      "Paper2":[80,99,78,78,55],
                      "Paper3":[60,49,68,86,95]})

In [56]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [62]:
mySeries = pd.Series(np.arange(10))
newSeries = pd.Series(range(11,21))

In [66]:
frame = pd.DataFrame({'key1':mySeries, 'key2':newSeries})

In [67]:
frame

   key1  key2
0     0    11
1     1    12
2     2    13
3     3    14
4     4    15
5     5    16
6     6    17
7     7    18
8     8    19
9     9    20

# Data manupulation
 - Accessing a complete column
 - Accessing a complete row
 - Adding and removing columns
 - Adding and remving a row

In [68]:
dataframe

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [69]:
dataframe['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [70]:
dataframe['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [71]:
dataframe['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [72]:
dataframe[dataframe['pop']<2]

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [73]:
dataframe[dataframe['year']==2001]

    state  year  pop
1    Ohio  2001  1.7
3  Nevada  2001  2.4

In [80]:
dataframe[(dataframe['year']==2001) & (dataframe['state']=="Ohio") & (dataframe['pop']>2)]

Empty DataFrame
Columns: [state, year, pop]
Index: []

# Selecing more than one column

In [81]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [82]:
result[['student_roll', 'Paper1']]

   student_roll  Paper1
0           123      90
1           456      89
2           321      78
3           678      76
4           111      65

In [97]:
result[result['student_name'].str.startswith(('a',"A"))]

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49

In [100]:
result[result['student_name'].str.startswith(('a',"A"))][['Paper2','Paper3']]

   Paper2  Paper3
0      80      60
1      99      49

# Adding more columns to existing frame

In [102]:
result

  student_name  student_roll  Paper1  Paper2  Paper3
0         Asad           123      90      80      60
1          Ali           456      89      99      49
2       Faheem           321      78      78      68
3        Baber           678      76      78      86
4        Nasir           111      65      55      95

In [106]:
result['Total'] = 100
result

  student_name  student_roll  Paper1  Paper2  Paper3  Total  Test
0         Asad           123      90      80      60    100     3
1          Ali           456      89      99      49    100     4
2       Faheem           321      78      78      68    100     5
3        Baber           678      76      78      86    100     6
4        Nasir           111      65      55      95    100     7

In [107]:
result['Total'] = result['Paper1'] + result['Paper2']+ result["Paper3"]
result

  student_name  student_roll  Paper1  Paper2  Paper3  Total  Test
0         Asad           123      90      80      60    230     3
1          Ali           456      89      99      49    237     4
2       Faheem           321      78      78      68    224     5
3        Baber           678      76      78      86    240     6
4        Nasir           111      65      55      95    215     7

In [105]:
result['Test'] = [3,4,5,6,7]
result

  student_name  student_roll  Paper1  Paper2  Paper3  Total  Test
0         Asad           123      90      80      60    230     3
1          Ali           456      89      99      49    237     4
2       Faheem           321      78      78      68    224     5
3        Baber           678      76      78      86    240     6
4        Nasir           111      65      55      95    215     7

In [108]:
result['Percentage'] = result['Total']/300*100
result

  student_name  student_roll  Paper1  Paper2  Paper3  Total  Test  Percentage
0         Asad           123      90      80      60    230     3   76.666667
1          Ali           456      89      99      49    237     4   79.000000
2       Faheem           321      78      78      68    224     5   74.666667
3        Baber           678      76      78      86    240     6   80.000000
4        Nasir           111      65      55      95    215     7   71.666667

In [1]:
result['Grade'] = [for per in result['Percentage'] if per>80 ]

SyntaxError: invalid syntax (Temp/ipykernel_8556/1142606560.py, line 1)

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

NameError: name 'pd' is not defined